README.md

# Table of Contents

1.  [Esercizio 1](#orgcedcdd7)
    1.  [Denning-sacco](#org509e68c)
        1.  [File Horn](#org8cdc52e)
        2.  [Proverif Output](#orgc0a3ed3)
    2.  [Denning-sacco corretto](#org24e6212)
        1.  [File Horn](#orga9ee583)
        2.  [Proverif Output](#org547ef96)
    3.  [Risultati](#org909528e)
2.  [Esercizio 2](#org08b66be)
    1.  [Hybrid Protocol](#org1b60004)
        1.  [File Horn](#org6c1126e)
        2.  [Proverif Output](#org2f98138)
    2.  [Hybrid Protocol Corrected](#orgc12c2ac)
        1.  [File horn](#orgd4b56a9)
        2.  [Proverif Output](#org3f26225)
        3.  [Risultati](#org1c443b1)
    3.  [False alarm protocol](#org3a05a2e)
        1.  [File horn](#orgf8202a8)
        2.  [Proverif Output](#org149dcea)
        3.  [Risultati](#org821bfde)



<a id="orgcedcdd7"></a>

# Esercizio 1


<a id="org509e68c"></a>

## Denning-sacco


<a id="org8cdc52e"></a>

### File Horn

    pred c/1 elimVar,decompData.
    nounif c:x.
    
    fun pk/1.
    fun encrypt/2.
    
    fun sign/2.
    
    query c:secret[].
    
    reduc
    (* Initialization *)
    
    c:c[];
    c:pk(sA[]);
    c:pk(sB[]);
    
    (* The attacker *)
    
    c:x & c:encrypt(m,pk(x)) -> c:m;
    c:x -> c:pk(x);
    c:x & c:y -> c:encrypt(x,y);
    c:sign(x,y) -> c:x;
    c:x & c:y -> c:sign(x,y);
    
    (* The protocol *)
    (* A *)
    
    c:pk(x) -> c:encrypt(sign(k[pk(x)], sA[]), pk(x));
    
    (* B *)
    
    c:encrypt(sign(k, sA[]), pk(sB[])) -> c:encrypt(secret[], pk(k)).


<a id="orgc0a3ed3"></a>

### Proverif Output

    $ proverif denning-sacco.horn
    Initial clauses:
    Clause 11: c:c[]
    Clause 10: c:pk(sA[])
    Clause 9: c:pk(sB[])
    Clause 8: c:x & c:encrypt(m,pk(x)) -> c:m
    Clause 7: c:x -> c:pk(x)
    Clause 6: c:x & c:y -> c:encrypt(x,y)
    Clause 5: c:sign(x,y) -> c:x
    Clause 4: c:x & c:y -> c:sign(x,y)
    Clause 3: c:pk(x) -> c:encrypt(sign(k[pk(x)],sA[]),pk(x))
    Clause 2: c:encrypt(sign(k_1,sA[]),pk(sB[]))
                  -> c:encrypt(secret[],pk(k_1))
    Clause 1: c:new-name[!att = v]
    Completing...
    goal reachable: c:secret[]
    
    Derivation:
    Abbreviations:
    k_1 = k[pk(x)]
    clause 8 c:secret[]
        clause 5 c:k_1
            duplicate c:sign(k_1,sA[])
        clause 2 c:encrypt(secret[],pk(k_1))
            clause 6 c:encrypt(sign(k_1,sA[]),pk(sB[]))
                clause 8 c:sign(k_1,sA[])
                    duplicate c:x
                    clause 3 c:encrypt(sign(k_1,sA[]),pk(x))
                        clause 7 c:pk(x)
                            any c:x
                clause 9 c:pk(sB[])
    RESULT goal reachable: c:secret[]


<a id="org24e6212"></a>

## Denning-sacco corretto


<a id="orga9ee583"></a>

### File Horn

    pred c/1 elimVar,decompData.
    nounif c:x.
    
    fun pk/1.
    fun encrypt/2.
    
    fun sign/2.
    
    query c:secret[].
    
    reduc
    (* Initialization *)
    
    c:c[];
    c:pk(sA[]);
    c:pk(sB[]);
    
    (* The attacker *)
    
    c:x & c:encrypt(m,pk(x)) -> c:m;
    c:x -> c:pk(x);
    c:x & c:y -> c:encrypt(x,y);
    c:sign(x,y) -> c:x;
    c:x & c:y -> c:sign(x,y);
    
    (* The protocol *)
    (* A *)
    
    c:pk(x) -> c:encrypt(sign((pk(sA[]), pk(x), k[pk(x)]), sA[]), pk(x));
    
    (* B *)
    
    c:encrypt(sign((pk(sA[]), pk(sB[]), k), sA[]), pk(sB[]))
        -> c:encrypt(secret[], pk(k)).


<a id="org547ef96"></a>

### Proverif Output

    $ proverif denning-sacco-corrected.horn
    Initial clauses:
    Clause 15: c:(v,v_1,v_2) -> c:v_2
    Clause 14: c:(v,v_1,v_2) -> c:v_1
    Clause 13: c:(v,v_1,v_2) -> c:v
    Clause 12: c:v & c:v_1 & c:v_2 -> c:(v,v_1,v_2)
    Clause 11: c:c[]
    Clause 10: c:pk(sA[])
    Clause 9: c:pk(sB[])
    Clause 8: c:x & c:encrypt(m,pk(x)) -> c:m
    Clause 7: c:x -> c:pk(x)
    Clause 6: c:x & c:y -> c:encrypt(x,y)
    Clause 5: c:sign(x,y) -> c:x
    Clause 4: c:x & c:y -> c:sign(x,y)
    Clause 3: c:pk(x) -> c:encrypt(sign((pk(sA[]),pk(x),k[pk(x)]),sA[]),pk(x))
    Clause 2: c:encrypt(sign((pk(sA[]),pk(sB[]),k_1),sA[]),pk(sB[]))
                  -> c:encrypt(secret[],pk(k_1))
    Clause 1: c:new-name[!att = v]
    Completing...
    RESULT goal unreachable: c:secret[]


<a id="org909528e"></a>

## Risultati

Dall&rsquo;output delle due istanze si nota sin da subito che solo nel primo caso l&rsquo;attaccante riesce ad ottenere *secret[]* e quindi *proverif* rileva un errore.
Ciò è possibile dato che nella prima istanza si assume che l&rsquo;attaccante non arrivi mai a conoscenza di una chiave di sessione. Ciò rende infatti il protocollo vulnerabile al *replay attack*, in quanto, se l&rsquo;attaccante entra in possesso di una chiave di sessione potrà cifrare un nuovo messaggio che sarà accettato dalla vittima.
Nella seconda istanza ciò non accade dato che è presente come ulteriore forma di sicurezza una *signature* del messaggio scambiato durante la cifratura:

<div class="org-center">
<pre class="example">
c:pk(x) -&gt; c:encrypt(sign((pk(sA[]), pk(x), k[pk(x)]), sA[]), pk(x));
</pre>
</div>
