README.tex

\section{Esercizio 2}
\label{sec:orgd8a2367}
\subsection{Hybrid Protocol}
\label{sec:org2a9580d}
\subsubsection{File Horn}
\label{sec:orga428347}
\begin{verbatim}
pred c/1 elimVar,decompData.
nounif c:x.

fun pk/1.
fun sencrypt/2.
fun pencrypt/2.

query c:secret[].

reduc
(* Initialization *)
c:c[];
c:pk(sA[]);
c:pk(sB[]);


(* The attacker *)
c:x -> c:pk(x);

c:x & c:pencrypt(m,pk(x)) -> c:m;
c:x & c:y -> c:pencrypt(x,y);

c:k & c:m -> c:sencrypt(m,k);
c:k & c:sencrypt(m,k) -> c:m;


(* The protocol *)
(* A *)
c:pk(x) -> c:pencrypt(secret[], pk(x));

(* B *)
c:pencrypt(secret[], pk(sA[])) -> c:sencrypt(secret[], m[]).
\end{verbatim}

\subsubsection{Proverif Output}
\label{sec:org58bfab4}
\begin{verbatim}
$ proverif hybrid-protocol.horn
Initial clauses:
Clause 11: c:c[]
Clause 10: c:pk(sA[])
Clause 9: c:pk(sB[])
Clause 8: c:x -> c:pk(x)
Clause 7: c:x & c:pencrypt(m_1,pk(x)) -> c:m_1
Clause 6: c:x & c:y -> c:pencrypt(x,y)
Clause 5: c:k & c:m_1 -> c:sencrypt(m_1,k)
Clause 4: c:k & c:sencrypt(m_1,k) -> c:m_1
Clause 3: c:pk(x) -> c:pencrypt(secret[],pk(x))
Clause 2: c:pencrypt(secret[],pk(sA[])) -> c:sencrypt(secret[],m[])
Clause 1: c:new-name[!att = v]
Completing...
goal reachable: c:secret[]

Derivation:
clause 7 c:secret[]
    duplicate c:x
    clause 3 c:pencrypt(secret[],pk(x))
        clause 8 c:pk(x)
            any c:x

RESULT goal reachable: c:secret[]
\end{verbatim}
\subsection{Hybrid Protocol Corrected}
\label{sec:org768e539}
\subsubsection{File horn}
\label{sec:orgaeacb24}
\begin{verbatim}
pred c/1 elimVar,decompData.
nounif c:x.

fun pk/1.
fun sencrypt/2.
fun pencrypt/2.
fun sign/2.

query c:secret[]. (* shared key not found *)

reduc
(* Initialization *)
c:c[];
c:pk(sA[]);
c:pk(sB[]);


(* The attacker *)
c:x -> c:pk(x);

c:x & c:pencrypt(m,pk(x)) -> c:m;
c:x & c:y -> c:pencrypt(x,y);

c:k & c:m -> c:sencrypt(m,k);
c:k & c:sencrypt(m,k) -> c:m;

c:sign(x,y) -> c:x;
c:x & c:y -> c:sign(x,y);

(* The protocol *)
(* A *)
c:pk(x) -> c:pencrypt((k[pk(x)], sign(k[pk(x)], sA[])), pk(x));

(* B *)
c:pencrypt((k[pk(sB[])], sign(k[pk(sB[])], sA[])), pk(sB[]))
    -> c:sencrypt(secret[], k[pk(sB[])]).
\end{verbatim}

\subsubsection{Proverif Output}
\label{sec:org25abe7c}
\begin{verbatim}
$ proverif hybrid-protocol-corrected.horn
Initial clauses:
Clause 16: c:(v,v_1) -> c:v_1
Clause 15: c:(v,v_1) -> c:v
Clause 14: c:v & c:v_1 -> c:(v,v_1)
Clause 13: c:c[]
Clause 12: c:pk(sA[])
Clause 11: c:pk(sB[])
Clause 10: c:x -> c:pk(x)
Clause 9: c:x & c:pencrypt(m,pk(x)) -> c:m
Clause 8: c:x & c:y -> c:pencrypt(x,y)
Clause 7: c:k_1 & c:m -> c:sencrypt(m,k_1)
Clause 6: c:k_1 & c:sencrypt(m,k_1) -> c:m
Clause 5: c:sign(x,y) -> c:x
Clause 4: c:x & c:y -> c:sign(x,y)
Clause 3: c:pk(x) -> c:pencrypt((k[pk(x)],sign(k[pk(x)],sA[])),pk(x))
Clause 2: c:pencrypt((k[pk(sB[])],sign(k[pk(sB[])],sA[])),pk(sB[]))
              -> c:sencrypt(secret[],k[pk(sB[])])
Clause 1: c:new-name[!att = v]
Completing...
RESULT goal unreachable: c:secret[]
\end{verbatim}

\subsubsection{Risultati}
\label{sec:orgc8e2e10}
Il protocollo ibrido proposto nel secondo esercizio non risulta essere sicuro in quanto non vi è alcuna forma di integrità durante lo scambio dei messaggi, in particolare della chiave condivisa. Ciò porta l'attaccante a poter eseguire un attacco al protocollo. Per ovviare a questo problema si è inserita una \emph{signature} della chiave scambiata che ne certifica l'integrità.
\subsection{False alarm protocol}
\label{sec:org424a29e}
\subsubsection{File horn}
\label{sec:org51bc49f}
\begin{verbatim}
pred c/1 elimVar,decompData.
nounif c:x.

fun pk/1.
fun pencrypt/2.

query c:secret[].

reduc
(* Initialization *)

c:c[];
c:pk(sA[]);
c:pk(sB[]);

(* The attacker *)
c:x -> c:pk(x);

c:x & c:pencrypt(m,pk(x)) -> c:m;
c:x & c:m -> c:pencrypt(x,m);

(* The protocol *)
(* A *)
c:pk(x) -> c:pencrypt(n1[pk(x)], pk(x));
c:pk(x) -> c:pencrypt(n2[pk(x)], pk(x));

c:pencrypt(n1[pk(sA[])], pk(sA[])) &
    c:pencrypt(n2[pk(sA[])], pk(sA[])) -> c:secret[];


(* B *)
c:pencrypt(n1[pk(sA[])], pk(sB[])) -> c:pencrypt(n1[pk(sA[])], pk(sA[]));
c:pencrypt(n2[pk(sA[])], pk(sB[])) -> c:pencrypt(n2[pk(sA[])], pk(sA[])).
\end{verbatim}
\subsubsection{Proverif Output}
\label{sec:orgf1d3299}
\begin{verbatim}
$ proverif false-error-protocol.horn
Initial clauses:
Clause 12: c:c[]
Clause 11: c:pk(sA[])
Clause 10: c:pk(sB[])
Clause 9: c:x -> c:pk(x)
Clause 8: c:x & c:pencrypt(m,pk(x)) -> c:m
Clause 7: c:x & c:m -> c:pencrypt(x,m)
Clause 6: c:pk(x) -> c:pencrypt(n1[pk(x)],pk(x))
Clause 5: c:pk(x) -> c:pencrypt(n2[pk(x)],pk(x))
Clause 4: c:pencrypt(n1[pk(sA[])],pk(sA[])) &
              c:pencrypt(n2[pk(sA[])],pk(sA[])) -> c:secret[]
Clause 3: c:pencrypt(n1[pk(sA[])],pk(sB[])) -> c:pencrypt(n1[pk(sA[])],pk(sA[]))
Clause 2: c:pencrypt(n2[pk(sA[])],pk(sB[])) -> c:pencrypt(n2[pk(sA[])],pk(sA[]))
Clause 1: c:new-name[!att = v]
Completing...
goal reachable: c:secret[]

Derivation:
Abbreviations:
n1_1 = n1[pk(sA[])]
n2_1 = n2[pk(sA[])]
clause 4 c:secret[]
    clause 6 c:pencrypt(n1_1,pk(sA[]))
        duplicate c:pk(sA[])
    clause 5 c:pencrypt(n2_1,pk(sA[]))
        clause 11 c:pk(sA[])

RESULT goal reachable: c:secret[]
\end{verbatim}
