README.org
*** Risultati
Il protocollo proposto mostra un semplice ma efficace esempio di come un sistema di /over-approximation/ come /proverif/ può portare a dei /false alarms/.
In particolare il protocollo non è in alcun modo utilizzabile in quanto esso arriva a conclusione solo nel caso in cui /Alice/ abbia ricevuto da /Bob/ entrambi i /Nonces/ cifrati.
Ciò però non è possibile in quanto il protocollo definisce l'invio di un unico /Nonce/ da parte di /Bob/, pertanto /Alice/ non potrà mai riceverli entrambi.
Il /false-alarm/ è dato dal fatto che in /proverif/ non può essere definito l'invio di un messaggio una sola volta, infatti, il /secret[]/, ovvero il caso in cui /Alice/ abbia ricevuto entrambi i /Nonces/ è raggiungibile in quanto la /over-approximation/ aggiunge path inesistenti nella definizione reale del problema come appunto l'invio ripetuto di messaggi unici.
