README.tex
\subsubsection{Risultati}
\label{sec:org526b6a7}
Il protocollo proposto mostra un semplice ma efficace esempio di come un sistema di \emph{over-approximation} come \emph{proverif} può portare a dei \emph{false alarms}.
In particolare il protocollo non è in alcun modo utilizzabile in quanto esso arriva a conclusione solo nel caso in cui \emph{Alice} abbia ricevuto da \emph{Bob} entrambi i \emph{Nonces} cifrati.
Ciò però non è possibile in quanto il protocollo definisce l'invio di un unico \emph{Nonce} da parte di \emph{Bob}, pertanto \emph{Alice} non potrà mai riceverli entrambi.
Il \emph{false-alarm} è dato dal fatto che in \emph{proverif} non può essere definito l'invio di un messaggio una sola volta, infatti, il \emph{secret[]}, ovvero il caso in cui \emph{Alice} abbia ricevuto entrambi i \emph{Nonces} è raggiungibile in quanto la \emph{over-approximation} aggiunge path inesistenti nella definizione reale del problema come appunto l'invio ripetuto di messaggi unici.
\end{document}
